Revit 2024 API
BuiltInFailures.ElectricalFailures Class
 Failures about Electricity.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class ElectricalFailures
Visual Basic
Public NotInheritable Class ElectricalFailures
Visual C++
public ref class ElectricalFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures
See Also
BuiltInFailures.ElectricalFailures Members
Autodesk.Revit.DB Namespace